hoangducanh2005/bleach_vs_naruto_STM32F429ZI/Core/Src/battle_demo.c
#include "battle_demo.h"

#if defined(__GNUC__)
#pragma GCC optimize ("O2")
#endif

#include "combat_actor.h"
#include "combat_box.h"
#include "combat_rules.h"
#include "combat_input.h"
#include "chidori_data.h"
#include "ILI9341_GFX.h"
#include "lcd_port.h"
#include "sprite_data.h"
#include "sprite_render.h"
#include "stm32f4xx_hal.h"
#include "vizard_moveset.h"

#define BATTLE_TICK_MS 33U
#define BATTLE_GROUND_Y 205
#define BATTLE_P1_START_X 92
#define BATTLE_CPU_START_X 228
#define BATTLE_DEBUG_BOXES 0
#define BATTLE_GETSUGA_SPEED 10
#define BATTLE_GETSUGA_FRAME_MS 40U
#define BATTLE_GETSUGA_SPAWN_FRAME 4U
#define BATTLE_PROJECTILE_GETSUGA 0U
#define BATTLE_PROJECTILE_VIZARD 1U
#define BATTLE_VIZARD_TELEPORT_FRAME 3U
#define BATTLE_VIZARD_PROJECTILE_FRAME 5U
#define BATTLE_VIZARD_TELEPORT_GAP 42
#define BATTLE_AI_REACTION_MS 220U
#define BATTLE_AI_ATTACK_RANGE 54
#define BATTLE_AI_SKILL_RANGE 92
#define BATTLE_AI_NEAR_RANGE 72
#define BATTLE_AI_FAR_RANGE 132
#define BATTLE_AI_ACTION_MIN_MS 120U
#define BATTLE_AI_ACTION_MAX_MS 520U
#define BATTLE_OVER_INPUT_DELAY_MS 500U
#define BATTLE_OVER_CONFIRM_MASK \
  (COMBAT_INPUT_ATTACK | COMBAT_INPUT_SKILL | COMBAT_INPUT_JUMP | COMBAT_INPUT_DASH)

#define RGB565_BLACK 0x0000U
#define RGB565_WHITE 0xFFFFU
#define RGB565_SKY_TOP 0x5D7FU
#define RGB565_SKY_MID 0x865FU
#define RGB565_SKY_LOW 0xB73FU
#define RGB565_CLOUD 0xF7BEU
#define RGB565_CLOUD_SHADOW 0xCE79U
#define RGB565_MOUNTAIN_DARK 0x4A69U
#define RGB565_MOUNTAIN_LIGHT 0x6B6DU
#define RGB565_WALL_DARK 0x4208U
#define RGB565_WALL_LIGHT 0x632CU
#define RGB565_GROUND_TOP 0x7BEFU
#define RGB565_GROUND 0x39E7U
#define RGB565_GROUND_DARK 0x2104U
#define RGB565_LINE 0xEF5DU
#define RGB565_ACCENT_ORANGE 0xFD20U
#define RGB565_ACCENT_CYAN 0x07FFU
#define RGB565_HUD_BG 0x0842U
#define RGB565_HUD_FRAME 0xC618U
#define RGB565_HP_BACK 0x4208U
#define RGB565_HP_GOOD 0x07E0U
#define RGB565_HP_WARN 0xFD20U
#define RGB565_MANA 0x04FFU
#define RGB565_MANA_BACK 0x18C6U
#define RGB565_HURTBOX 0x07E0U
#define RGB565_HITBOX 0xF800U

typedef struct
{
  const uint16_t *pixels;
  uint16_t width;
  uint16_t height;
  int16_t x;
  int16_t y;
  uint8_t flipX;
  uint8_t valid;
} BattleActorSnapshot;

typedef struct
{
  int16_t x;
  int16_t y;
  int16_t w;
  int16_t h;
  uint8_t valid;
} BattleDirtyRect;

typedef struct
{
  int16_t x;
  int16_t y;
  int16_t vx;
  uint8_t active;
  uint8_t frameIndex;
  uint8_t kind;
  uint8_t hitConnected;
  uint32_t startedMs;
} BattleProjectile;

typedef enum
{
  BATTLE_AI_ACTION_HOLD = 0U,
  BATTLE_AI_ACTION_APPROACH,
  BATTLE_AI_ACTION_RETREAT,
  BATTLE_AI_ACTION_BLOCK,
  BATTLE_AI_ACTION_ATTACK,
  BATTLE_AI_ACTION_SKILL,
  BATTLE_AI_ACTION_DASH,
  BATTLE_AI_ACTION_JUMP
} BattleAiAction;

typedef struct
{
  int16_t selfX;
  int16_t targetX;
  int16_t targetY;
  uint16_t selfHp;
  uint16_t targetHp;
  CombatAnimState selfState;
  CombatAnimState targetState;
  uint8_t targetFrameIndex;
  uint8_t targetAttackStep;
  uint8_t targetOnGround;
  uint8_t valid;
} BattleAiObservation;

typedef struct
{
  BattleAiObservation visible;
  BattleAiObservation pending;
  BattleAiAction action;
  BattleAiAction queuedAction;
  uint32_t pendingSeenMs;
  uint32_t actionStartedMs;
  uint32_t actionDurationMs;
  uint32_t nextThinkMs;
  uint32_t rng;
} BattleAiController;

static CombatActor s_player;
static CombatActor s_cpu;
static BattleProjectile s_getsuga;
static BattleAiController s_cpuAi;
static BattleActorSnapshot s_playerSnapshot;
static BattleActorSnapshot s_cpuSnapshot;
static BattleActorSnapshot s_getsugaSnapshot;
static BattleActorSnapshot s_chidoriSnapshot;
static uint16_t s_compositeRun[LCD_PORT_WIDTH];
static uint32_t s_lastTickMs;
static uint16_t s_lastPlayerHp;
static uint16_t s_lastCpuHp;
static uint16_t s_lastPlayerMana;
static uint16_t s_lastCpuMana;
static uint32_t s_lastGetsugaSkillStartMs;
static uint32_t s_lastVizardSkillStartMs;
static uint32_t s_lastVizardProjectileSkillStartMs;
static uint32_t s_battleOverStartedMs;
static uint8_t s_vizardTeleported;
static uint8_t s_battleOver;
static uint8_t s_battleWon;
static uint8_t s_battleOverInputArmed;
static CombatCharacterId s_playerCharacter = COMBAT_CHARACTER_VIZARD_ICHIGO;
static CombatCharacterId s_cpuCharacter = COMBAT_CHARACTER_SASUKE;

static const CombatHitboxDef s_getsugaHitbox = {
    0U,
    0U,
    {8, 18, 38, 36},
    15U,
    3U,
    300U,
    160U,
    22,
    0,
    COMBAT_HIT_LEVEL_PROJECTILE,
    1U,
};

static const CombatHitboxDef s_vizardProjectileHitbox = {
    0U,
    0U,
    {6, 24, 46, 38},
    16U,
    3U,
    320U,
    170U,
    24,
    0,
    COMBAT_HIT_LEVEL_PROJECTILE,
    1U,
};

static void Battle_DrawFrame(void);
static void Battle_DrawActorsInitial(void);
static void Battle_UpdateActors(void);
static void Battle_AiInit(BattleAiController *ai, uint32_t nowMs);
static uint8_t Battle_AiUpdate(BattleAiController *ai,
                               const CombatActor *self,
                               const CombatActor *target,
                               uint32_t nowMs);
static void Battle_AiObserve(BattleAiController *ai,
                             const CombatActor *self,
                             const CombatActor *target,
                             uint32_t nowMs);
static BattleAiAction Battle_AiChooseAction(BattleAiController *ai,
                                            const CombatActor *self,
                                            const CombatActor *target,
                                            uint32_t nowMs);
static uint8_t Battle_AiActionToInput(BattleAiAction action,
                                      const CombatActor *self,
                                      const CombatActor *target,
                                      uint32_t nowMs);
static uint16_t Battle_AiRandom(BattleAiController *ai, uint16_t maxValue);
static int16_t Battle_AbsI16(int16_t value);
static void Battle_UpdateVizardSkill(uint32_t nowMs);
static void Battle_TrySpawnGetsuga(uint32_t nowMs);
static void Battle_UpdateGetsuga(uint32_t nowMs);
static void Battle_ResolveProjectileHit(BattleProjectile *projectile,
                                        CombatActor *owner,
                                        CombatActor *target,
                                        uint32_t nowMs);
static void Battle_DrawBackground(void);
static void Battle_DrawStaticSky(void);
static void Battle_DrawGround(void);
static void Battle_DrawArenaMarks(void);
static void Battle_DrawHud(void);
static void Battle_DrawBattleOverHud(uint8_t won);
static uint8_t Battle_UpdateBattleOver(uint32_t nowMs);
static void Battle_CheckBattleOver(uint32_t nowMs);
static void Battle_DrawHealthBar(uint16_t x, uint16_t y, uint16_t hp,
                                 uint16_t borderColor, uint8_t reverse);
static void Battle_UpdateHealthBar(uint16_t x, uint16_t y, uint16_t oldHp,
                                   uint16_t newHp, uint16_t borderColor,
                                   uint8_t reverse);
static void Battle_DrawManaBar(uint16_t x, uint16_t y, uint16_t mana,
                               uint8_t reverse);
static void Battle_DrawMeter(uint16_t x, uint16_t y, uint16_t width,
                             uint16_t height, uint16_t value,
                             uint16_t maxValue, uint16_t fillColor,
                             uint16_t backColor, uint16_t borderColor,
                             uint8_t reverse);
static void Battle_DrawActor(const CombatActor *actor,
                             BattleActorSnapshot *snapshot);
static uint8_t Battle_CaptureActor(const CombatActor *actor,
                                   BattleActorSnapshot *snapshot);
static uint8_t Battle_CaptureGetsuga(const BattleProjectile *projectile,
                                     BattleActorSnapshot *snapshot);
static uint8_t Battle_CaptureChidori(const CombatActor *actor,
                                     BattleActorSnapshot *snapshot);
static void Battle_DrawActorSnapshot(const BattleActorSnapshot *snapshot);
static uint8_t Battle_ActorSnapshotEqual(const BattleActorSnapshot *a,
                                         const BattleActorSnapshot *b);
static void Battle_DirtyRectAddSnapshot(BattleDirtyRect *rect,
                                        const BattleActorSnapshot *snapshot);
static void Battle_DrawSnapshotChange(const BattleActorSnapshot *previous,
                                      const BattleActorSnapshot *next,
                                      const BattleActorSnapshot *player,
                                      const BattleActorSnapshot *cpu,
                                      const BattleActorSnapshot *projectile,
                                      const BattleActorSnapshot *chidori,
                                      uint8_t allowSplit);
static void Battle_DrawDirtyRect(BattleDirtyRect rect,
                                 const BattleActorSnapshot *player,
                                 const BattleActorSnapshot *cpu,
                                 const BattleActorSnapshot *projectile,
                                 const BattleActorSnapshot *chidori);
static uint8_t Battle_DirtyRectsShouldSplit(BattleDirtyRect a,
                                            BattleDirtyRect b);
static void Battle_ComposeActorRow(BattleDirtyRect rect,
                                   const BattleActorSnapshot *snapshot,
                                   uint16_t screenY);
static void Battle_DrawDebugBoxes(void);
#if BATTLE_DEBUG_BOXES
static void Battle_DrawBox(CombatBox box, uint16_t color);
#endif
static void Battle_ResolveHit(CombatActor *attacker, CombatActor *target,
                              uint32_t nowMs);
static uint16_t Battle_GetBackgroundPixel(uint16_t x, uint16_t y);
static void Battle_FillSafe(int16_t x, int16_t y, int16_t width,
                            int16_t height, uint16_t color);

void BattleDemo_SetCharacters(CombatCharacterId playerCharacter,
                              CombatCharacterId cpuCharacter)
{
  s_playerCharacter = playerCharacter;
  s_cpuCharacter = cpuCharacter;
}

void BattleDemo_Init(void)
{
  uint32_t now = HAL_GetTick();

  LCD_Port_Init();
  CombatInput_Init();
  CombatActor_Init(&s_player,
                   s_playerCharacter,
                   BATTLE_P1_START_X,
                   BATTLE_GROUND_Y,
                   1,
                   now);
  CombatActor_Init(&s_cpu,
                   s_cpuCharacter,
                   BATTLE_CPU_START_X,
                   BATTLE_GROUND_Y,
                   -1,
                   now);
  s_lastTickMs = now;
  s_lastPlayerHp = s_player.hp;
  s_lastCpuHp = s_cpu.hp;
  s_lastPlayerMana = s_player.mana;
  s_lastCpuMana = s_cpu.mana;
  s_playerSnapshot.valid = 0U;
  s_cpuSnapshot.valid = 0U;
  s_getsugaSnapshot.valid = 0U;
  s_chidoriSnapshot.valid = 0U;
  s_getsuga.active = 0U;
  s_getsuga.kind = BATTLE_PROJECTILE_GETSUGA;
  s_lastGetsugaSkillStartMs = 0U;
  s_lastVizardSkillStartMs = 0U;
  s_lastVizardProjectileSkillStartMs = 0U;
  s_battleOverStartedMs = 0U;
  s_vizardTeleported = 0U;
  s_battleOver = 0U;
  s_battleWon = 0U;
  s_battleOverInputArmed = 0U;
  Battle_AiInit(&s_cpuAi, now);

