hoangducanh2005/bleach_vs_naruto_STM32F429ZI/Core/Src/battle_demo.c
  int16_t x0 = box.x;
  int16_t y0 = box.y;
  int16_t x1 = (int16_t)(box.x + box.w);
  int16_t y1 = (int16_t)(box.y + box.h);

  if ((x1 <= 0) || (y1 <= 0) ||
      (x0 >= (int16_t)LCD_PORT_WIDTH) ||
      (y0 >= (int16_t)LCD_PORT_HEIGHT))
  {
    return;
  }

  x0 = CombatBox_ClampI16(x0, 0, (int16_t)(LCD_PORT_WIDTH - 1U));
  y0 = CombatBox_ClampI16(y0, 0, (int16_t)(LCD_PORT_HEIGHT - 1U));
  x1 = CombatBox_ClampI16(x1, 0, (int16_t)(LCD_PORT_WIDTH - 1U));
  y1 = CombatBox_ClampI16(y1, 0, (int16_t)(LCD_PORT_HEIGHT - 1U));

  ILI9341_DrawHollowRectangleCoord((uint16_t)x0,
                                   (uint16_t)y0,
                                   (uint16_t)x1,
                                   (uint16_t)y1,
                                   color);
}
#endif

static void Battle_DrawHud(void)
{
  LCD_Port_FillRect(0U, 0U, LCD_PORT_WIDTH, 37U, RGB565_HUD_BG);
  LCD_Port_FillRect(0U, 36U, LCD_PORT_WIDTH, 1U, RGB565_HUD_FRAME);

  ILI9341_DrawText("VIZARD", FONT1, 10U, 3U, RGB565_WHITE, RGB565_HUD_BG);
  ILI9341_DrawText("SASUKE", FONT1, 262U, 3U, RGB565_WHITE, RGB565_HUD_BG);

  Battle_DrawHealthBar(10U, 15U, s_player.hp, RGB565_ACCENT_CYAN, 0U);
  Battle_DrawManaBar(10U, 27U, s_player.mana, 0U);

  Battle_DrawHealthBar(206U, 15U, s_cpu.hp, RGB565_ACCENT_ORANGE, 1U);
  Battle_DrawManaBar(226U, 27U, s_cpu.mana, 1U);

  ILI9341_DrawHollowRectangleCoord(142U, 5U, 177U, 27U, RGB565_HUD_FRAME);
  LCD_Port_FillRect(143U, 6U, 34U, 21U, RGB565_BLACK);
  ILI9341_DrawText("60", FONT3, 148U, 8U, RGB565_WHITE, RGB565_BLACK);
}

static void Battle_DrawBattleOverHud(uint8_t won)
{
  uint16_t accent = (won != 0U) ? RGB565_ACCENT_CYAN : RGB565_ACCENT_ORANGE;

  LCD_Port_FillRect(40U, 70U, 240U, 98U, RGB565_HUD_BG);
  ILI9341_DrawHollowRectangleCoord(40U, 70U, 279U, 167U, accent);
  ILI9341_DrawHollowRectangleCoord(43U, 73U, 276U, 164U, RGB565_HUD_FRAME);

  if (won != 0U)
  {
    ILI9341_DrawText("YOU WIN", FONT4, 111U, 91U, RGB565_WHITE, RGB565_HUD_BG);
    ILI9341_DrawText("CPU DEFEATED", FONT2, 101U, 119U, accent, RGB565_HUD_BG);
  }
  else
  {
    ILI9341_DrawText("GAME OVER", FONT4, 96U, 91U, RGB565_WHITE, RGB565_HUD_BG);
    ILI9341_DrawText("PLAYER DOWN", FONT2, 104U, 119U, accent, RGB565_HUD_BG);
  }

  ILI9341_DrawText("ATTACK: MAIN MENU", FONT1, 91U, 146U,
                   RGB565_WHITE, RGB565_HUD_BG);
}

static uint8_t Battle_UpdateBattleOver(uint32_t nowMs)
{
  uint8_t input = CombatInput_Read();

  if ((uint32_t)(nowMs - s_battleOverStartedMs) < BATTLE_OVER_INPUT_DELAY_MS)
  {
    return 0U;
  }

  if ((input & BATTLE_OVER_CONFIRM_MASK) == 0U)
  {
    s_battleOverInputArmed = 1U;
    return 0U;
  }

  return (s_battleOverInputArmed != 0U) ? 1U : 0U;
}

static void Battle_CheckBattleOver(uint32_t nowMs)
{
  if (s_battleOver != 0U)
  {
    return;
  }

  if ((s_player.hp != 0U) && (s_cpu.hp != 0U))
  {
    return;
  }

  s_battleOver = 1U;
  s_battleWon = (s_cpu.hp == 0U) && (s_player.hp != 0U) ? 1U : 0U;
  s_battleOverStartedMs = nowMs;
  s_battleOverInputArmed = 0U;
  s_getsuga.active = 0U;
  Battle_DrawBattleOverHud(s_battleWon);
}

static void Battle_DrawHealthBar(uint16_t x, uint16_t y, uint16_t hp,
                                 uint16_t borderColor, uint8_t reverse)
{
  uint16_t fill = (hp > 30U) ? RGB565_HP_GOOD : RGB565_HP_WARN;

  Battle_DrawMeter(x, y, 104U, 8U, hp, 100U, fill, RGB565_HP_BACK,
                   borderColor, reverse);
}

static void Battle_UpdateHealthBar(uint16_t x, uint16_t y, uint16_t oldHp,
                                   uint16_t newHp, uint16_t borderColor,
                                   uint8_t reverse)
{
  uint16_t oldFill = (oldHp > 30U) ? RGB565_HP_GOOD : RGB565_HP_WARN;
  uint16_t newFill = (newHp > 30U) ? RGB565_HP_GOOD : RGB565_HP_WARN;
  uint16_t innerWidth = 102U;
  uint16_t innerHeight = 6U;
  uint16_t oldValue = (oldHp > 100U) ? 100U : oldHp;
  uint16_t newValue = (newHp > 100U) ? 100U : newHp;
  uint16_t oldFillWidth =
      (uint16_t)(((uint32_t)innerWidth * oldValue) / 100U);
  uint16_t newFillWidth =
      (uint16_t)(((uint32_t)innerWidth * newValue) / 100U);
  uint16_t changedWidth;
  uint16_t changedX;

  if (oldFill != newFill)
  {
    Battle_DrawHealthBar(x, y, newHp, borderColor, reverse);
    return;
  }

  if (oldFillWidth == newFillWidth)
  {
    return;
  }

  changedWidth = (oldFillWidth > newFillWidth)
                     ? (uint16_t)(oldFillWidth - newFillWidth)
                     : (uint16_t)(newFillWidth - oldFillWidth);

  if (newFillWidth > oldFillWidth)
  {
    changedX = (reverse != 0U)
                   ? (uint16_t)(x + 1U + innerWidth - newFillWidth)
                   : (uint16_t)(x + 1U + oldFillWidth);
    LCD_Port_FillRect(changedX, (uint16_t)(y + 1U), changedWidth,
                      innerHeight, newFill);
    return;
  }

  changedX = (reverse != 0U)
                 ? (uint16_t)(x + 1U + innerWidth - oldFillWidth)
                 : (uint16_t)(x + 1U + newFillWidth);
  LCD_Port_FillRect(changedX, (uint16_t)(y + 1U), changedWidth,
                    innerHeight, RGB565_HP_BACK);
}

static void Battle_DrawManaBar(uint16_t x, uint16_t y, uint16_t mana, uint8_t reverse)
{
  Battle_DrawMeter(x, y, 84U, 5U, mana, 100U, RGB565_MANA,
                   RGB565_MANA_BACK, RGB565_HUD_FRAME, reverse);
}

static void Battle_DrawMeter(uint16_t x, uint16_t y, uint16_t width,
                             uint16_t height, uint16_t value,
                             uint16_t maxValue, uint16_t fillColor,
                             uint16_t backColor, uint16_t borderColor,
                             uint8_t reverse)
{
  if ((width < 3U) || (height < 3U) || (maxValue == 0U))
  {
    return;
  }

  uint16_t innerWidth = (uint16_t)(width - 2U);
  uint16_t innerHeight = (uint16_t)(height - 2U);
  uint16_t clampedValue = (value > maxValue) ? maxValue : value;
  uint16_t fillWidth =
      (uint16_t)(((uint32_t)innerWidth * clampedValue) / maxValue);

  ILI9341_DrawHollowRectangleCoord(x, y,
                                   (uint16_t)(x + width - 1U),
                                   (uint16_t)(y + height - 1U),
                                   borderColor);
  LCD_Port_FillRect((uint16_t)(x + 1U), (uint16_t)(y + 1U),
                    innerWidth, innerHeight, backColor);

  if (fillWidth == 0U)
  {
    return;
  }

  uint16_t fillX = (reverse != 0U)
                       ? (uint16_t)(x + 1U + innerWidth - fillWidth)
                       : (uint16_t)(x + 1U);
  LCD_Port_FillRect(fillX, (uint16_t)(y + 1U), fillWidth, innerHeight,
                    fillColor);
}



